<a href="https://colab.research.google.com/github/rayjinghaolei/Shopify-challenge/blob/master/Fall_2021_shopify_challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
#load the dataset
df = pd.read_csv('2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv')
df.head()

   order_id  shop_id  user_id  ...  total_items  payment_method           created_at
0         1       53      746  ...            2            cash  2017-03-13 12:36:56
1         2       92      925  ...            1            cash  2017-03-03 17:38:52
2         3       44      861  ...            1            cash   2017-03-14 4:23:56
3         4       18      935  ...            1     credit_card  2017-03-26 12:43:37
4         5       18      883  ...            1     credit_card   2017-03-01 4:35:11

[5 rows x 7 columns]

# Outliers
As we can see here, there are quite a few extreme orders in this dataset, such as an order of $704000 with 2000 items. These will not reflect the average case of a customer buying a sneaker.

In [ ]:
extreme_orders = df[df.order_amount > 1000]
extreme_orders

      order_id  shop_id  ...  payment_method           created_at
15          16       42  ...     credit_card   2017-03-07 4:00:00
60          61       42  ...     credit_card   2017-03-04 4:00:00
160        161       78  ...     credit_card   2017-03-12 5:56:57
490        491       78  ...           debit  2017-03-26 17:08:19
493        494       78  ...            cash  2017-03-16 21:39:35
...        ...      ...  ...             ...                  ...
4646      4647       42  ...     credit_card   2017-03-02 4:00:00
4715      4716       78  ...           debit   2017-03-05 5:10:44
4868      4869       42  ...     credit_card   2017-03-22 4:00:00
4882      4883       42  ...     credit_card   2017-03-25 4:00:00
4918      4919       78  ...            cash  2017-03-15 13:26:46

[71 rows x 7 columns]

# The problematic solution
The solution just takes the mean value of the order_amount as the AOV which gives the amount of 3145.128. If the price of a sneaker is about $100 on average, the old AOV means that each customer buys about 31 sneakers every order. But if we take a closer look at the data, most customers spend 100 - 500 dollars on each order.

In [ ]:
old_AOV = df['order_amount'].mean()
old_AOV

3145.128

# A Better Metric
In this case, using median than mean will be a better representation of the average order value because an average customer will not buy 2000 sneakers or a 25725 dollars' sneaker. The median value is 284 dollar which is a fair, affordable amount to pay to get a sneaker.

In [ ]:
AOV = df['order_amount'].median()
AOV

284.0